//alert("Hello? i'm first your pragram"); - запуск диалогового окна с кнопкой ОК

/*
Типы данных: 
    + булианы (true / false) - отвечают за состояние (1, 0)
    + числа (12, 12.2, -12) - 
    + строки ('asdadsghj') - 

    Логические операции
        равны ли выражение / x == 12 
        больше > / больше или равно >=
        больше < / больше или равно <=
        x != 12 - не равно
        
    Математические операции 
    3 (операнд) + (оператор) - сложение (операция) 
    
    + сложение
    - вычитание
    * умножение 
    / деление 
    ** - воведение в степень (2**2 - 2 в квадрате)

*/

console.log('Hello World'); // - вывод 
console.log(12 + 12); //24
console.log(true); // true
console.log('x = 12 ?', 12 == 12); // true

//!!!!!!!НЕПРАВИЛЬНЫЙ ВАРИАНТ СОЗДАНИЯ ПЕРЕМЕННОЙ!!!!!!!!
x = 12; // = - присвоение
console.log(x);
//стаарый дедовский вариант, до 2015 актуально
var y = 13;
console.log(y);
//Совремееный вариант 
let z = 19; 
console.log(z);
//Констанаты
const pi = 3.14; 

let s = 'Hello';
s = 12;
s = true;
let t = true;
